{
  "title": "Lets Go Out",
  "description": "Connect with new friends in your vicinity with LetsGoOut, a cross-platform social networking app available on iPhone and Android.",
  "image": "assets/images/projects/letsgoout/logo.png",
  "details": {
    "role_and_timeline": [
      "Role: Mobile Application Developer",
      "Timeline: Sep 2011 - Oct 2012",
      "Associated with: HuLeTS"
    ],
    "description": "Physical is the new social’. LetsGoOut is a cross-platform application designed for Natural Networking. It utilizes your device’s capabilities to find and connect with new friends in your vicinity without any additional costs. LetsGoOut provides a seamless and intuitive user experience, encouraging spontaneous interactions and socialization on the go",
    "platform": "iOS 4 to 5",
    "frameworks:": [
      "Gamekit for P2P (Peer-to-Peer) communication"
    ],
    "app_store_link": [
      "http://itunes.apple.com/us/app/letsgoout/id483119735?mt=8"
    ],
    "role_and_responsibility": [
      "Designed and developed the application from concept to deployment.",
      "Implemented the Gamekit framework for peer-to-peer communication, enabling users to find and connect with friends nearby.",
      "Ensured compatibility across different versions of iOS (4 to 5).",
      "Collaborated with designers to create an intuitive and engaging user interface.",
      "Conducted extensive testing to ensure the app’s stability and performance across various devices.",
      "Worked on bug fixing and improving application performance.",
      "",
      "This project was a significant step in my career, allowing me to explore and implement innovative social networking solutions on mobile platforms."
    ],
    "screenshots": [
      "assets/images/projects/letsgoout/1.png",
      "assets/images/projects/letsgoout/2.png",
      "assets/images/projects/letsgoout/3.png",
      "assets/images/projects/letsgoout/4.png",
      "assets/images/projects/letsgoout/5.png",
      "assets/images/projects/letsgoout/6.png",
      "assets/images/projects/letsgoout/7.png"
    ]
  }
}